garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1574.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x393">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:desc="" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:desc="" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:desc="" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:desc="" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:desc="" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:desc="" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAF" edc:desc="" edc:mask="0x3f" edc:name="IOCAF" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x394"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCCP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCCP" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x397">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:desc="" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:desc="" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:desc="" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:desc="" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:desc="" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:desc="" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCCP" edc:desc="" edc:mask="0x3f" edc:name="IOCCP" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCCN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCCN" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x398">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:desc="" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:desc="" edc:mask="0x1" edc:name="IOCCN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:desc="" edc:mask="0x1" edc:name="IOCCN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:desc="" edc:mask="0x1" edc:name="IOCCN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:desc="" edc:mask="0x1" edc:name="IOCCN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:desc="" edc:mask="0x1" edc:name="IOCCN5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCCN" edc:desc="" edc:mask="0x3f" edc:name="IOCCN" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCCF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCCF" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x399">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:desc="" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:desc="" edc:mask="0x1" edc:name="IOCCF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:desc="" edc:mask="0x1" edc:name="IOCCF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:desc="" edc:mask="0x1" edc:name="IOCCF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:desc="" edc:mask="0x1" edc:name="IOCCF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:desc="" edc:mask="0x1" edc:name="IOCCF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCCF" edc:desc="" edc:mask="0x3f" edc:name="IOCCF" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x400"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4a0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x480"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x500"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5a0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x580"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x600"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6a0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CWG1DBR" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-01488_A4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWG1DBR" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1DBR0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CWG1DBF" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-01488_A4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWG1DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1DBF0" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF1" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF2" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF3" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF4" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn--n" edc:cname="CWG1CON0" edc:desc="Configurable logic cell control" edc:impl="0xf9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--x" edc:name="CWG1CON0" edc:nzwidth="8" edc:por="00000--x" edc:_modsrc="DOS-01488_A4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1POLA" edc:desc="" edc:mask="0x1" edc:name="G1POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLB" edc:desc="" edc:mask="0x1" edc:name="G1POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OEA" edc:desc="" edc:mask="0x1" edc:name="G1OEA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1OEB" edc:desc="" edc:mask="0x1" edc:name="G1OEB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x1" edc:name="G1CS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="CWG1CON1" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-xxx" edc:name="CWG1CON1" edc:nzwidth="8" edc:por="xxxx-xxx" edc:_modsrc="DOS-01488_A4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1IS0" edc:desc="" edc:mask="0x1" edc:name="G1IS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1IS1" edc:desc="" edc:mask="0x1" edc:name="G1IS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1IS2" edc:desc="" edc:mask="0x1" edc:name="G1IS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDLA" edc:desc="" edc:mask="0x3" edc:name="G1ASDLA" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G1ASDLB" edc:desc="" edc:mask="0x3" edc:name="G1ASDLB" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1IS" edc:desc="" edc:mask="0x7" edc:name="G1IS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="G1ASDLA0" edc:desc="" edc:mask="0x1" edc:name="G1ASDLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDLA1" edc:desc="" edc:mask="0x1" edc:name="G1ASDLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDLB0" edc:desc="" edc:mask="0x1" edc:name="G1ASDLB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1ASDLB1" edc:desc="" edc:mask="0x1" edc:name="G1ASDLB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
