garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1574.PIC
        <edc:JoinedSFRDef edc:cname="PWM3OF" edc:desc="" edc:name="PWM3OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM3OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3OFL" edc:desc="" edc:mask="0xff" edc:name="PWM3OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM3OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3OFH" edc:desc="" edc:mask="0xff" edc:name="PWM3OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3TMR" edc:desc="" edc:name="PWM3TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM3TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM3TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM3TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
