garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1574.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM4DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4DCH" edc:desc="" edc:mask="0xff" edc:name="PWM4DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4PR" edc:desc="" edc:name="PWM4PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM4PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4PRL" edc:desc="" edc:mask="0xff" edc:name="PWM4PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM4PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4PRH" edc:desc="" edc:mask="0xff" edc:name="PWM4PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4OF" edc:desc="" edc:name="PWM4OF" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC7">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4OFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4OFL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDC7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4OFL0" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL1" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL2" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL3" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL4" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL5" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL6" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4OFL7" edc:desc="" edc:mask="0x1" edc:name="PWM4OFL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM4OFL" edc:desc="" edc:mask="0xff" edc:name="PWM4OFL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
