garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1574.PIC
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM4OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM4OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDD0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM4OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM4OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM4OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM4OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM4OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM4OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM4OFS" edc:desc="" edc:mask="0x3" edc:name="PWM4OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM4OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM4OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OFM" edc:desc="" edc:mask="0x3" edc:name="PWM4OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe70" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xE0C"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xE0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:desc="" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INTPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INTPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPPS" edc:desc="" edc:mask="0x1f" edc:name="INTPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INTPPS0" edc:desc="" edc:mask="0x1" edc:name="INTPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS1" edc:desc="" edc:mask="0x1" edc:name="INTPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS2" edc:desc="" edc:mask="0x1" edc:name="INTPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS3" edc:desc="" edc:mask="0x1" edc:name="INTPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS4" edc:desc="" edc:mask="0x1" edc:name="INTPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:desc="" edc:mask="0x1f" edc:name="T0CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:desc="" edc:mask="0x1f" edc:name="T1CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
